problem_dict = {
    '91': '请删除无用sheet页',
    '92': '建议项目名称填需求编号+需求名',
    '93': '请填写项目名称',
    '94': '请检查上线编号',
    '95': '请填写上线编号',
    '01': '请删除空行',
    '02': '注意斜杠格式应该为/',
    '03': '路径应该以https开头',
    '04': '该路径源码无此版本源码',
    '05': '源码清单登记非最新版本源码请确认',
    '06': '源码上传说明建议以软件需求编号开头',
    '07': '开发人员应于svn上传人用户名相同',
    '08': '提交日期与SVN服务器应一致',
    '09': '源码清单不应包含文件夹记录',
    '10': '版本号不可为空',
    '11': '提交日期不可为空',
    '12': '开发人员不可为空',
    '13': '版本号须为数值型',
    '14': '日期须为日期型'
}

svn = {
    'server': 'https://10.16.80.52:8443/svn'
}